CSI API ETABS v1
cDesignSteel.Eurocode_3_2005 Property
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
cDStEurocode_3_2005 Eurocode_3_2005 { get; }
ReadOnly Property Eurocode_3_2005 As cDStEurocode_3_2005
	Get
Dim instance As cDesignSteel
Dim value As cDStEurocode_3_2005
value = instance.Eurocode_3_2005
property cDStEurocode_3_2005^ Eurocode_3_2005 {
	cDStEurocode_3_2005^ get ();
}
abstract Eurocode_3_2005 : cDStEurocode_3_2005 with get
Property Value
Type: cDStEurocode_3_2005
See Also
Reference
cDesignSteel Interface
ETABSv1 Namespace